src/main/resources/music-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:us="http://localhost/teste">
    <soapenv:Header/>
    <soapenv:Body>
        <us:getAllMusicsRequest/>
    </soapenv:Body>
</soapenv:Envelope>